Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF8627.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PORTD" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF83">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD0" edc:desc="" edc:mask="0x1" edc:name="RD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD1" edc:desc="" edc:mask="0x1" edc:name="RD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD2" edc:desc="" edc:mask="0x1" edc:name="RD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD3" edc:desc="" edc:mask="0x1" edc:name="RD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4" edc:desc="" edc:mask="0x1" edc:name="RD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5" edc:desc="" edc:mask="0x1" edc:name="RD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6" edc:desc="" edc:mask="0x1" edc:name="RD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7" edc:desc="" edc:mask="0x1" edc:name="RD7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSP0" edc:desc="" edc:mask="0x1" edc:name="PSP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSP1" edc:desc="" edc:mask="0x1" edc:name="PSP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSP2" edc:desc="" edc:mask="0x1" edc:name="PSP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSP3" edc:desc="" edc:mask="0x1" edc:name="PSP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSP4" edc:desc="" edc:mask="0x1" edc:name="PSP4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSP5" edc:desc="" edc:mask="0x1" edc:name="PSP5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSP6" edc:desc="" edc:mask="0x1" edc:name="PSP6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSP7" edc:desc="" edc:mask="0x1" edc:name="PSP7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="AD0" edc:desc="" edc:mask="0x1" edc:name="AD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD1" edc:desc="" edc:mask="0x1" edc:name="AD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD2" edc:desc="" edc:mask="0x1" edc:name="AD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD3" edc:desc="" edc:mask="0x1" edc:name="AD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD4" edc:desc="" edc:mask="0x1" edc:name="AD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD5" edc:desc="" edc:mask="0x1" edc:name="AD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD6" edc:desc="" edc:mask="0x1" edc:name="AD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD7" edc:desc="" edc:mask="0x1" edc:name="AD7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="SDA2" edc:desc="" edc:mask="0x1" edc:name="SDA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCL2" edc:desc="" edc:mask="0x1" edc:name="SCL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SS2" edc:desc="" edc:mask="0x1" edc:name="SS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SDO2" edc:desc="" edc:mask="0x1" edc:name="SDO2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SDI2" edc:desc="" edc:mask="0x1" edc:name="SDI2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCK2" edc:desc="" edc:mask="0x1" edc:name="SCK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nSS2" edc:desc="" edc:mask="0x1" edc:name="nSS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="PORTE" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF84">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE0" edc:desc="" edc:mask="0x1" edc:name="RE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1" edc:desc="" edc:mask="0x1" edc:name="RE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2" edc:desc="" edc:mask="0x1" edc:name="RE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE3" edc:desc="" edc:mask="0x1" edc:name="RE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE4" edc:desc="" edc:mask="0x1" edc:name="RE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE5" edc:desc="" edc:mask="0x1" edc:name="RE5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE6" edc:desc="" edc:mask="0x1" edc:name="RE6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE7" edc:desc="" edc:mask="0x1" edc:name="RE7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RD" edc:desc="" edc:mask="0x1" edc:name="RD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x1" edc:name="CS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="ECCP2" edc:desc="" edc:mask="0x1" edc:name="ECCP2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="nRD" edc:desc="" edc:mask="0x1" edc:name="nRD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nWR" edc:desc="" edc:mask="0x1" edc:name="nWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nCS" edc:desc="" edc:mask="0x1" edc:name="nCS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CCP2" edc:desc="" edc:mask="0x1" edc:name="CCP2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="AD8" edc:desc="" edc:mask="0x1" edc:name="AD8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD9" edc:desc="" edc:mask="0x1" edc:name="AD9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD10" edc:desc="" edc:mask="0x1" edc:name="AD10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD11" edc:desc="" edc:mask="0x1" edc:name="AD11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD12" edc:desc="" edc:mask="0x1" edc:name="AD12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD13" edc:desc="" edc:mask="0x1" edc:name="AD13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD14" edc:desc="" edc:mask="0x1" edc:name="AD14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD15" edc:desc="" edc:mask="0x1" edc:name="AD15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="P2D" edc:desc="" edc:mask="0x1" edc:name="P2D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P2C" edc:desc="" edc:mask="0x1" edc:name="P2C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P2B" edc:desc="" edc:mask="0x1" edc:name="P2B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P3C" edc:desc="" edc:mask="0x1" edc:name="P3C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P3B" edc:desc="" edc:mask="0x1" edc:name="P3B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P1C" edc:desc="" edc:mask="0x1" edc:name="P1C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P1B" edc:desc="" edc:mask="0x1" edc:name="P1B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P2A" edc:desc="" edc:mask="0x1" edc:name="P2A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="PD2" edc:desc="" edc:mask="0x1" edc:name="PD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PC2" edc:desc="" edc:mask="0x1" edc:name="PC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP10" edc:desc="" edc:mask="0x1" edc:name="CCP10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP9E" edc:desc="" edc:mask="0x1" edc:name="CCP9E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8E" edc:desc="" edc:mask="0x1" edc:name="CCP8E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7E" edc:desc="" edc:mask="0x1" edc:name="CCP7E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP6E" edc:desc="" edc:mask="0x1" edc:name="CCP6E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2E" edc:desc="" edc:mask="0x1" edc:name="CCP2E" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:SFRFieldDef edc:cname="RDE" edc:desc="" edc:mask="0x1" edc:name="RDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WRE" edc:desc="" edc:mask="0x1" edc:name="WRE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PB2" edc:desc="" edc:mask="0x1" edc:name="PB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PC3E" edc:desc="" edc:mask="0x1" edc:name="PC3E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PB3E" edc:desc="" edc:mask="0x1" edc:name="PB3E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PC1E" edc:desc="" edc:mask="0x1" edc:name="PC1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PB1E" edc:desc="" edc:mask="0x1" edc:name="PB1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PA2E" edc:desc="" edc:mask="0x1" edc:name="PA2E" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="PORTF" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF85">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RF0" edc:desc="" edc:mask="0x1" edc:name="RF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF1" edc:desc="" edc:mask="0x1" edc:name="RF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF2" edc:desc="" edc:mask="0x1" edc:name="RF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF3" edc:desc="" edc:mask="0x1" edc:name="RF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF4" edc:desc="" edc:mask="0x1" edc:name="RF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF5" edc:desc="" edc:mask="0x1" edc:name="RF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF6" edc:desc="" edc:mask="0x1" edc:name="RF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF7" edc:desc="" edc:mask="0x1" edc:name="RF7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AN5" edc:desc="" edc:mask="0x1" edc:name="AN5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN6" edc:desc="" edc:mask="0x1" edc:name="AN6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN7" edc:desc="" edc:mask="0x1" edc:name="AN7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN8" edc:desc="" edc:mask="0x1" edc:name="AN8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN9" edc:desc="" edc:mask="0x1" edc:name="AN9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN10" edc:desc="" edc:mask="0x1" edc:name="AN10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN11" edc:desc="" edc:mask="0x1" edc:name="AN11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SS1" edc:desc="" edc:mask="0x1" edc:name="SS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2OUT" edc:desc="" edc:mask="0x1" edc:name="C2OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1OUT" edc:desc="" edc:mask="0x1" edc:name="C1OUT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CVREF" edc:desc="" edc:mask="0x1" edc:name="CVREF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="nSS1" edc:desc="" edc:mask="0x1" edc:name="nSS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="C2OUTF" edc:desc="" edc:mask="0x1" edc:name="C2OUTF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1OUTF" edc:desc="" edc:mask="0x1" edc:name="C1OUTF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--rnnnnn" edc:cname="PORTG" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xxxxxx" edc:name="PORTG" edc:nzwidth="0x8" edc:por="--xxxxxx" edc:_addr="0xF86">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RG0" edc:desc="" edc:mask="0x1" edc:name="RG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG1" edc:desc="" edc:mask="0x1" edc:name="RG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG2" edc:desc="" edc:mask="0x1" edc:name="RG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG3" edc:desc="" edc:mask="0x1" edc:name="RG3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG4" edc:desc="" edc:mask="0x1" edc:name="RG4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG5" edc:desc="" edc:mask="0x1" edc:name="RG5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ECCP3" edc:desc="" edc:mask="0x1" edc:name="ECCP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX2" edc:desc="" edc:mask="0x1" edc:name="TX2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX2" edc:desc="" edc:mask="0x1" edc:name="RX2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP4" edc:desc="" edc:mask="0x1" edc:name="CCP4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP5" edc:desc="" edc:mask="0x1" edc:name="CCP5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MCLR" edc:desc="" edc:mask="0x1" edc:name="MCLR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="P3A" edc:desc="" edc:mask="0x1" edc:name="P3A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CK2" edc:desc="" edc:mask="0x1" edc:name="CK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DT2" edc:desc="" edc:mask="0x1" edc:name="DT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P3D" edc:desc="" edc:mask="0x1" edc:name="P3D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P1D" edc:desc="" edc:mask="0x1" edc:name="P1D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nMCLR" edc:desc="" edc:mask="0x1" edc:name="nMCLR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CCP3" edc:desc="" edc:mask="0x1" edc:name="CCP3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="C3OUTG" edc:desc="" edc:mask="0x1" edc:name="C3OUTG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="RJPU" edc:desc="" edc:mask="0x1" edc:name="RJPU" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="PORTH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF87">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RH0" edc:desc="" edc:mask="0x1" edc:name="RH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH1" edc:desc="" edc:mask="0x1" edc:name="RH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH2" edc:desc="" edc:mask="0x1" edc:name="RH2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH3" edc:desc="" edc:mask="0x1" edc:name="RH3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH4" edc:desc="" edc:mask="0x1" edc:name="RH4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH5" edc:desc="" edc:mask="0x1" edc:name="RH5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH6" edc:desc="" edc:mask="0x1" edc:name="RH6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH7" edc:desc="" edc:mask="0x1" edc:name="RH7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="A16" edc:desc="" edc:mask="0x1" edc:name="A16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="A17" edc:desc="" edc:mask="0x1" edc:name="A17" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="A18" edc:desc="" edc:mask="0x1" edc:name="A18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="A19" edc:desc="" edc:mask="0x1" edc:name="A19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN12" edc:desc="" edc:mask="0x1" edc:name="AN12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN13" edc:desc="" edc:mask="0x1" edc:name="AN13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN14" edc:desc="" edc:mask="0x1" edc:name="AN14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN15" edc:desc="" edc:mask="0x1" edc:name="AN15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="P3C" edc:desc="" edc:mask="0x1" edc:name="P3C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P3B" edc:desc="" edc:mask="0x1" edc:name="P3B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P1C" edc:desc="" edc:mask="0x1" edc:name="P1C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P1B" edc:desc="" edc:mask="0x1" edc:name="P1B" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="CCP9" edc:desc="" edc:mask="0x1" edc:name="CCP9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8" edc:desc="" edc:mask="0x1" edc:name="CCP8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7" edc:desc="" edc:mask="0x1" edc:name="CCP7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP6" edc:desc="" edc:mask="0x1" edc:name="CCP6" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="PC3" edc:desc="" edc:mask="0x1" edc:name="PC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PB3" edc:desc="" edc:mask="0x1" edc:name="PB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PC1" edc:desc="" edc:mask="0x1" edc:name="PC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PB1" edc:desc="" edc:mask="0x1" edc:name="PB1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
